MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F512H.atdf
         <register caption="DMA Channel x Control Register" name="DCH6CON" offset="0x4e0" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH6CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH6CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH6CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH6CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH6CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH6CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH6CON__CHCHNS" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH6CON__CHBUSY" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH7CON" offset="0x5a0" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH7CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH7CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH7CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH7CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH7CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH7CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH7CON__CHCHNS" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH7CON__CHBUSY" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH0ECON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH0ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH0ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH0ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH0ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH0ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH0ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH0ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH1ECON" offset="0x130" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH1ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH1ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH1ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH1ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH1ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH1ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH1ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH2ECON" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH2ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH2ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH2ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH2ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH2ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH2ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH2ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH3ECON" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH3ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH3ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH3ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH3ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH3ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH3ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH3ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH4ECON" offset="0x370" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH4ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH4ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH4ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH4ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH4ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH4ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH4ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH5ECON" offset="0x430" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH5ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH5ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH5ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH5ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH5ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH5ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH5ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH6ECON" offset="0x4f0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH6ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH6ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH6ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH6ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH6ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH6ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH6ECON__CHAIRQ" />
         </register>
